Revit 2027 API
AnalyticalSupportType Enumeration
 Indicates what kind of support another Element provides -- Point, Surface, or Curve.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalyticalSupportType
Public Enumeration AnalyticalSupportType
public enum class AnalyticalSupportType
type AnalyticalSupportType
Members
Member name | Value | Description
CurveSupport | 2 |  Support along a curve.
PointSupport | 1 |  Support at just one point.
SurfaceSupport | 3 |  Support along a surface.
UnknownSupport | 0 |  Support has not been determined.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace